In [17]:
import pandas.io.sql
import pyodbc

In [22]:
# Parameters
server = 'LONDB03'
db = 'Support_DMART'

# Create the connection
conn = pyodbc.connect('DRIVER={SQL Server};SERVER=' + DB['servername'] + ';DATABASE=' + DB['database'] + ';Trusted_Connection=yes')

# query db
sql = """

SELECT top 10 *
FROM dim.date

"""
df = pandas.io.sql.read_sql(sql, conn)
df.head(10)

,Date_KEY,Date_Full_Date,Date_Day_Number,Date_Day_Of_Week,Date_Month_Number,Date_Month_Desc,Date_Month_Abbr,Date_Year_Number,Date_Quarter_Number,Date_Quarter_Desc,Date_Business_Day_Number,Date_Year_Month_Key,Date_Last_Day_Month_Flag,Rec_Added,Rec_Updated,Current_Record,Date_Week_Year_Number,Date_Week_Month_Number,Date_day_yr,Date_Day_Week
0,20010101,2001-01-01,1,Monday,1,January,Jan,2001,1,2001-1,1,0,0,2005-10-31 14:15:58.233,2007-03-05 18:28:00.157,1,1,1,1,2
1,20010102,2001-01-02,2,Tuesday,1,January,Jan,2001,1,2001-1,2,0,0,2005-10-31 14:15:58.233,2007-03-05 18:28:00.157,1,1,1,2,3
2,20010103,2001-01-03,3,Wednesday,1,January,Jan,2001,1,2001-1,3,0,0,2005-10-31 14:15:58.250,2007-03-05 18:28:00.157,1,1,1,3,4
3,20010104,2001-01-04,4,Thursday,1,January,Jan,2001,1,2001-1,4,0,0,2005-10-31 14:15:58.250,2007-03-05 18:28:00.157,1,1,1,4,5
4,20010105,2001-01-05,5,Friday,1,January,Jan,2001,1,2001-1,5,0,0,2005-10-31 14:15:58.250,2007-03-05 18:28:00.157,1,1,1,5,6
5,20010106,2001-01-06,6,Saturday,1,January,Jan,2001,1,2001-1,0,0,0,2005-10-31 14:15:58.263,2007-03-05 18:28:00.157,1,1,1,6,7
6,20010107,2001-01-07,7,Sunday,1,January,Jan,2001,1,2001-1,0,0,0,2005-10-31 14:15:58.263,2007-03-05 18:28:00.157,1,2,2,7,1
7,20010108,2001-01-08,8,Monday,1,January,Jan,2001,1,2001-1,6,0,0,2005-10-31 14:15:58.280,2007-03-05 18:28:00.157,1,2,2,8,2
8,20010109,2001-01-09,9,Tuesday,1,January,Jan,2001,1,2001-1,7,0,0,2005-10-31 14:15:58.280,2007-03-05 18:28:00.157,1,2,2,9,3
9,20010110,2001-01-10,10,Wednesday,1,January,Jan,2001,1,2001-1,8,0,0,2005-10-31 14:15:58.280,2007-03-05 18:28:00.157,1,2,2,10,4